jeffborg/esp8266-fastled-webserver/src/esp8266-fastled-webserver.cpp
typedef struct {
  CRGBPalette16 palette;
  String name;
} PaletteAndName;
typedef PaletteAndName PaletteAndNameList[];

const CRGBPalette16 palettes[] = {
    RainbowColors_p,
    RainbowStripeColors_p,
    CloudColors_p,
    LavaColors_p,
    OceanColors_p,
    ForestColors_p,
    PartyColors_p,
    HeatColors_p
};

const uint8_t paletteCount = ARRAY_SIZE(palettes);

const String paletteNames[paletteCount] = {
    "Rainbow",
    "Rainbow Stripe",
    "Cloud",
    "Lava",
    "Ocean",
    "Forest",
    "Party",
    "Heat",
};

#include "Fields.h"
// include network sync to other esp
#include "udpSync.h"

void setup() {
  WiFi.setSleepMode(WIFI_NONE_SLEEP);

  Serial.begin(115200);
  delay(100);
  Serial.setDebugOutput(true);

  FastLED.addLeds<LED_TYPE, ESP_DATA_PIN, COLOR_ORDER>(leds, PHYSICAL_NUM_LEDS);         // for WS2812 (Neopixel)
  //FastLED.addLeds<LED_TYPE,DATA_PIN,CLK_PIN,COLOR_ORDER>(leds, NUM_LEDS); // for APA102 (Dotstar)
  FastLED.setDither(false);
  FastLED.setCorrection(TypicalLEDStrip);
  FastLED.setBrightness(brightness);
  FastLED.setMaxPowerInVoltsAndMilliamps(5, MILLI_AMPS);
  pinMode(LED_BUILTIN, OUTPUT);
  set_max_power_indicator_LED(LED_BUILTIN);

  fill_solid(leds, PHYSICAL_NUM_LEDS, CRGB::Black);
  FastLED.show();

  EEPROM.begin(512);
  loadSettings();

  FastLED.setBrightness(brightness);

  //  irReceiver.enableIRIn(); // Start the receiver

  Serial.println();
  Serial.print( F("Heap: ") ); Serial.println(system_get_free_heap_size());
  Serial.print( F("Boot Vers: ") ); Serial.println(system_get_boot_version());
  Serial.print( F("CPU: ") ); Serial.println(system_get_cpu_freq());
  Serial.print( F("SDK: ") ); Serial.println(system_get_sdk_version());
  Serial.print( F("Chip ID: ") ); Serial.println(system_get_chip_id());
  Serial.print( F("Flash ID: ") ); Serial.println(spi_flash_get_id());
  Serial.print( F("Flash Size: ") ); Serial.println(ESP.getFlashChipRealSize());
  Serial.print( F("Vcc: ") ); Serial.println(ESP.getVcc());
  Serial.println();

  SPIFFS.begin();
  {
    Serial.println("SPIFFS contents:");

    Dir dir = SPIFFS.openDir("/");
    while (dir.next()) {
      String fileName = dir.fileName();
      size_t fileSize = dir.fileSize();
      Serial.printf("FS File: %s, size: %s\n", fileName.c_str(), String(fileSize).c_str());
    }
    Serial.printf("\n");
  }

  //disabled due to https://github.com/jasoncoon/esp8266-fastled-webserver/issues/62
  //initializeWiFi();

  // Do a little work to get a unique-ish name. Get the
  // last two bytes of the MAC (HEX'd)":
  uint8_t mac[WL_MAC_ADDR_LENGTH];
  WiFi.softAPmacAddress(mac);
  String macID = String(mac[WL_MAC_ADDR_LENGTH - 2], HEX) +
                 String(mac[WL_MAC_ADDR_LENGTH - 1], HEX);
  macID.toUpperCase();

  nameString = "ESP8266-" + macID;

  #ifdef WIFI_NAME
  const char* nameChar = WIFI_NAME;
  #else
  char nameChar[nameString.length() + 1];
  memset(nameChar, 0, nameString.length() + 1);

  for (int i = 0; i < nameString.length(); i++)
    nameChar[i] = nameString.charAt(i);
  #endif

  Serial.printf("Name: %s\n", nameChar );

  if (apMode)
  {
    WiFi.mode(WIFI_AP);

    WiFi.softAP(nameChar);

    Serial.printf("Connect to Wi-Fi access point: %s\n", nameChar);
    Serial.println("and open http://192.168.4.1 in your browser");
  }
  else
  {
    WiFi.mode(WIFI_STA);
    WiFi.hostname(nameString);
    Serial.printf("Connecting to %s\n", ssid);
    if (String(WiFi.SSID()) != String(ssid)) {
      WiFi.begin(ssid, password);
    }
  }

  udpSetup();

  httpUpdateServer.setup(&webServer);

  webServer.on("/all", HTTP_GET, []() {
    String json = getFieldsJson(fields, fieldCount);
    webServer.sendHeader("Access-Control-Allow-Origin", "*");
    webServer.send(200, "application/json", json);
  });

  webServer.on("/fieldValue", HTTP_GET, []() {
    String name = webServer.arg("name");
    String value = getFieldValue(name, fields, fieldCount);
    webServer.sendHeader("Access-Control-Allow-Origin", "*");
    webServer.send(200, "text/json", value);
  });

  webServer.on("/fieldValue", HTTP_POST, []() {
    String name = webServer.arg("name");
    String value = webServer.arg("value");
    String newValue = setFieldValue(name, value, fields, fieldCount);
    webServer.sendHeader("Access-Control-Allow-Origin", "*");
    webServer.send(200, "text/json", newValue);
  });

  webServer.on("/power", HTTP_POST, []() {
    String value = webServer.arg("value");
    setPower(value.toInt());
    webServer.sendHeader("Access-Control-Allow-Origin", "*");
    sendInt(power);
  });

  webServer.on("/cooling", HTTP_POST, []() {
    String value = webServer.arg("value");
    cooling = value.toInt();
    EEPROM.write(11, cooling);
    EEPROM.commit();
    broadcastInt("cooling", cooling);
    webServer.sendHeader("Access-Control-Allow-Origin", "*");
    sendInt(cooling);
  });

  webServer.on("/sparking", HTTP_POST, []() {
    String value = webServer.arg("value");
    sparking = value.toInt();
    EEPROM.write(12, sparking);
    EEPROM.commit();
    broadcastInt("sparking", sparking);
    webServer.sendHeader("Access-Control-Allow-Origin", "*");
    sendInt(sparking);
  });

  webServer.on("/speed", HTTP_POST, []() {
    String value = webServer.arg("value");
    speed = value.toInt();
    broadcastInt("speed", speed);
    webServer.sendHeader("Access-Control-Allow-Origin", "*");
    sendInt(speed);
  });

  webServer.on("/twinkleSpeed", HTTP_POST, []() {
    String value = webServer.arg("value");
    twinkleSpeed = value.toInt();
    if (twinkleSpeed < 0) twinkleSpeed = 0;
    else if (twinkleSpeed > 8) twinkleSpeed = 8;
    EEPROM.write(9, twinkleSpeed);
    EEPROM.commit();
    broadcastInt("twinkleSpeed", twinkleSpeed);
    webServer.sendHeader("Access-Control-Allow-Origin", "*");
    sendInt(twinkleSpeed);
  });

  webServer.on("/twinkleDensity", HTTP_POST, []() {
    String value = webServer.arg("value");
    twinkleDensity = value.toInt();
    if (twinkleDensity < 0) twinkleDensity = 0;
    else if (twinkleDensity > 8) twinkleDensity = 8;
    EEPROM.write(10, twinkleDensity);
    EEPROM.commit();
    broadcastInt("twinkleDensity", twinkleDensity);
    webServer.sendHeader("Access-Control-Allow-Origin", "*");
    sendInt(twinkleDensity);
  });

  webServer.on("/coolLikeIncandescent", HTTP_POST, []() {
    String value = webServer.arg("value");
    coolLikeIncandescent = value.toInt();
    if (coolLikeIncandescent < 0) coolLikeIncandescent = 0;
    else if (coolLikeIncandescent > 1) coolLikeIncandescent = 1;
    EEPROM.write(13, coolLikeIncandescent);
    EEPROM.commit();
    broadcastInt("coolLikeIncandescent", coolLikeIncandescent);
    sendInt(coolLikeIncandescent);
  });

